; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	infrared1 - mode
	spectrograph0 - mode
	infrared2 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	Planet3 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star2)
	(supports instrument3 infrared1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star2)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet5)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon7)
	(supports instrument6 infrared2)
	(supports instrument6 infrared1)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star1)
	(supports instrument7 infrared2)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 infrared1)
	(supports instrument8 infrared2)
	(calibration_target instrument8 Star2)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon13)
	(supports instrument9 infrared1)
	(supports instrument9 infrared2)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 GroundStation0)
	(supports instrument10 infrared1)
	(supports instrument10 spectrograph0)
	(calibration_target instrument10 Star1)
	(supports instrument11 infrared2)
	(supports instrument11 spectrograph0)
	(calibration_target instrument11 Star2)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star9)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite1 Planet8)
	(pointing satellite4 Planet5)
	(have_image Planet3 infrared1)
	(have_image Phenomenon4 infrared1)
	(have_image Planet5 spectrograph0)
	(have_image Phenomenon6 infrared1)
	(have_image Phenomenon7 infrared2)
	(have_image Planet8 spectrograph0)
	(have_image Star9 infrared2)
	(have_image Planet10 spectrograph0)
	(have_image Phenomenon11 infrared2)
	(have_image Star12 spectrograph0)
	(have_image Phenomenon13 infrared1)
	(have_image Planet14 infrared2)
	(have_image Phenomenon15 infrared2)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 16
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 16
3. (turn_to satellite4 planet5 star9)
   deleted: (pointing satellite4 star9)
   added: (pointing satellite4 planet5)
   goals met: 1 of 16
4. (turn_to satellite4 star1 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 star1)
   goals met: 0 of 16
5. (calibrate satellite4 instrument10 star1)
   added: (calibrated instrument10)
   goals met: 0 of 16
6. (turn_to satellite4 phenomenon13 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 phenomenon13)
   goals met: 0 of 16
7. (take_image satellite4 phenomenon13 instrument10 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 1 of 16
8. (turn_to satellite4 phenomenon4 phenomenon13)
   deleted: (pointing satellite4 phenomenon13)
   added: (pointing satellite4 phenomenon4)
   goals met: 1 of 16
9. (take_image satellite4 phenomenon4 instrument10 infrared1)
   added: (have_image phenomenon4 infrared1)
   goals met: 2 of 16
10. (turn_to satellite4 phenomenon6 phenomenon4)
   deleted: (pointing satellite4 phenomenon4)
   added: (pointing satellite4 phenomenon6)
   goals met: 2 of 16
11. (take_image satellite4 phenomenon6 instrument10 infrared1)
   added: (have_image phenomenon6 infrared1)
   goals met: 3 of 16
12. (turn_to satellite4 planet10 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 planet10)
   goals met: 3 of 16
13. (take_image satellite4 planet10 instrument10 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 4 of 16
14. (turn_to satellite4 planet3 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 planet3)
   goals met: 4 of 16
15. (take_image satellite4 planet3 instrument10 infrared1)
   added: (have_image planet3 infrared1)
   goals met: 5 of 16
16. (turn_to satellite4 planet5 planet3)
   deleted: (pointing satellite4 planet3)
   added: (pointing satellite4 planet5)
   goals met: 6 of 16
17. (take_image satellite4 planet5 instrument10 spectrograph0)
   added: (have_image planet5 spectrograph0)
   goals met: 7 of 16
18. (turn_to satellite3 phenomenon11 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon11)
   goals met: 7 of 16
19. (turn_to satellite3 star1 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 star1)
   goals met: 7 of 16
20. (calibrate satellite3 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 7 of 16
21. (turn_to satellite3 phenomenon11 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 phenomenon11)
   goals met: 7 of 16
22. (take_image satellite3 phenomenon11 instrument6 infrared2)
   added: (have_image phenomenon11 infrared2)
   goals met: 8 of 16
23. (turn_to satellite3 phenomenon15 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 phenomenon15)
   goals met: 8 of 16
24. (take_image satellite3 phenomenon15 instrument6 infrared2)
   added: (have_image phenomenon15 infrared2)
   goals met: 9 of 16
25. (turn_to satellite3 phenomenon7 phenomenon15)
   deleted: (pointing satellite3 phenomenon15)
   added: (pointing satellite3 phenomenon7)
   goals met: 9 of 16
26. (take_image satellite3 phenomenon7 instrument6 infrared2)
   added: (have_image phenomenon7 infrared2)
   goals met: 10 of 16
27. (turn_to satellite3 planet14 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 planet14)
   goals met: 10 of 16
28. (take_image satellite3 planet14 instrument6 infrared2)
   added: (have_image planet14 infrared2)
   goals met: 11 of 16
29. (turn_to satellite3 star9 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 star9)
   goals met: 11 of 16
30. (take_image satellite3 star9 instrument6 infrared2)
   added: (have_image star9 infrared2)
   goals met: 12 of 16
31. (turn_to satellite1 planet8 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet8)
   goals met: 13 of 16
32. (turn_to satellite0 groundstation0 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation0)
   goals met: 14 of 16
33. (turn_to satellite4 planet8 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 planet8)
   goals met: 13 of 16
34. (take_image satellite4 planet8 instrument10 spectrograph0)
   added: (have_image planet8 spectrograph0)
   goals met: 14 of 16
35. (turn_to satellite4 planet5 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 planet5)
   goals met: 15 of 16
36. (turn_to satellite3 star12 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 star12)
   goals met: 15 of 16
37. (take_image satellite3 star12 instrument6 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 16 of 16
